In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
%matplotlib inline

In [2]:
df = pd.read_csv('slums_data.csv')

In [3]:
df.head()

                                  Location  Men  Kids  Women  Total Category
0                                 Lingipur  100    36     71    207      Low
1                            Mahabhoisasan   87    37    145    269      Low
2                          Bahadalpur (og)  137   113    133    383     High
3                              Bankual(og)   65    44    144    253      Low
4  Industrial & Colony Area (og) (ward 61)  176    62    113    351   Medium

In [4]:
def find_min_differences(target_number, values):
    differences = [(value, abs(target_number - value)) for value in values]
    sorted_differences = sorted(differences, key=lambda x: x[1])
    min_diff_values = [item[0] for item in sorted_differences[:5]]

    return min_diff_values

# Example usage:
target_number = 10
my_values = [2, 7, 15, 5, 12, 8, 18, 3]
result = find_min_differences(target_number, my_values)

print(f"The 5 values with the minimum differences from {target_number} are: {result}")

The 5 values with the minimum differences from 10 are: [12, 8, 7, 15, 5]

In [5]:
find_min_differences(265,df['Total'])

[262, 269, 261, 270, 271]

In [7]:
df[df['Total'].isin([262, 269, 261, 270, 271])]

         Location  Men  Kids  Women  Total Category
1   Mahabhoisasan   87    37    145    269      Low
18   Bhagabatipur   73    53    145    271      Low
31     Haridamada  116    33    113    262      Low
42     Paikarapur  126    54     90    270      Low
55      Barimunda  110    57     94    261      Low

In [8]:
df[df['Total'].isin([262, 269, 261, 270, 271])]['Location']

1     Mahabhoisasan
18     Bhagabatipur
31       Haridamada
42       Paikarapur
55        Barimunda
Name: Location, dtype: object